# =========================
# اسم البرنامج
# =========================
TARGET = لغة

# =========================
# المترجم
# =========================
CC = gcc

# =========================
# خيارات الترجمة
# =========================
CFLAGS = -Wall -Wextra -O2

# =========================
# مسارات الرؤوس (Headers)
# =========================
INCLUDES = \
-Iالمحركات \
-Iالادراة \
-Iالادارة/مدير_التنفيذ \
-Iالادارة/مدير_التنفيذ/التنفيذ_الفردي\
-Iالادارة/مدير_البناء \
-Iالمحركات/المحرك \
-Iالمحركات/محرك_الترجمة \
-Iنظامي \
-Iالقاموس \
-Iالمحركات/المحرك_الرياضي \
-Iالمحركات/محرك_الفحص \
-Iالمحركات/محرك_الفحص/أدوات \
-Iالمحركات/المحرك_الرياضي/المتغيرات \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/اطبع \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/نفذ \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/نظف \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/تحميل \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/ادخل \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/خروج \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/حل \
-Iالمحركات/محرك_الترجمة/ألاوامر_الأساسة/احسب \
-Iالمحركات/محرك_الترجمة/الدوال_والشروط/الدالة \
-Iالمحركات/محرك_الترجمة/الدوال_والشروط/الشرط \
-Iالمحركات/محرك_الترجمة/الحلقات_التكرارية \
-Iالمحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/المقارنات \
-Iالمحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/الجذور \
-Iالمحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/المعادلات_الاسية \
-Iالمحركات/المحرك_الرياضي/الاعداد_الضخمة \
-Iالمحركات/المحرك_الرياضي/الدوال_المثلثية \
-Iالمحركات/المحرك_الرياضي/الثوابت \
-Iالمحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية \
-Iالمحركات/محرك_الدوال\

# =========================
# ملفات المصدر
# =========================
SOURCES = \
البوابة.c \
الادارة/مدير_التنفيذ/مدير_التنفيذ.c \
الادارة/مدير_التنفيذ/التنفيذ_الفردي/التنفيذ_الفردي.c \
المحركات/المحرك/المحرك.c \
الادارة/مدير_البناء/مدير_البناء.c \
المحركات/محرك_الترجمة/محرك_الترجمة.c \
المحركات/محرك_الدوال/محرك_الدالة.c \
المحركات/محرك_الفحص/محرك_الفحص.c \
المحركات/محرك_الفحص/أدوات/أدوات_الكشف.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/اطبع/اطبع.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/نفذ/نفذ.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/نظف/نظف.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/تحميل/تحميل.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/ادخل/ادخل.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/خروج/خروج.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/حل/حل.c \
المحركات/محرك_الترجمة/ألاوامر_الأساسة/احسب/احسب.c \
المحركات/محرك_الترجمة/الدوال_والشروط/الدالة/الدالة.c \
المحركات/محرك_الترجمة/الدوال_والشروط/الشرط/الشرط.c \
المحركات/محرك_الترجمة/الحلقات_التكرارية/الحلقات_التكرارية.c \
المحركات/المحرك_الرياضي/المحرك_الرياضي.c \
المحركات/المحرك_الرياضي/المتغيرات/محرك_المتغيرات.c \
المحركات/المحرك_الرياضي/الثوابت/محرك_الثوابت.c \
المحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/المقارنات/محرك_المقارنات.c \
المحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/الجذور/محرك_الجذور.c \
المحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/المعادلات_الاسية/محرك_الاسس.c \
المحركات/المحرك_الرياضي/الاعداد_الضخمة/محرك_الاعداد_الضخمة.c \
المحركات/المحرك_الرياضي/الدوال_المثلثية/محرك_الدوال_المثلثية.c \
المحركات/المحرك_الرياضي/العمليات_الحسابية_الاساسية/محرك_العمليات_الحسابية_الاساسية.c 



# =========================
# الهدف الافتراضي
# =========================
all:
	$(CC) $(CFLAGS) $(SOURCES) $(INCLUDES) -lm -o $(TARGET)

# =========================
# تشغيل البرنامج
# =========================
run: all
	./$(TARGET)

# =========================
# تنظيف
# =========================
clean:
	rm -f $(TARGET)
