#ifndef WORDS_H
#define WORDS_H

/* أوامر أساسية */
#define كلمة_اطبع   "اطبع"
#define كلمة_نفذ    "نفذ"
#define كلمة_احسب   "احسب"
#define كلمة_خروج   "خروج"
#define كلمة_نظف    "نظف"
#define كلمة_ادخل   "ادخل"
#define كلمة_تحميل  "تحميل"

/* الدوال */
#define كلمة_دالة   "دالة"

/* الشروط */
#define كلمة_اذا        "اذا"
#define كلمة_والا       "والا"
#define كلمة_والا_اذا   "والا اذا"

/* التكرار */
#define كلمة_كرر        "كرر"
#define كلمة_كسر        "كسر"

/* الرياضيات */
#define كلمة_حل     "حل"

#endif
